alpkonakci/mct-stm32-freertos/Sensor_Control/Core/Inc/FreeRTOSConfig.h
#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

#include <stdint.h>
#include "stm32f1xx.h"

extern uint32_t SystemCoreClock;

#define configUSE_PREEMPTION                     1
#define configUSE_PORT_OPTIMISED_TASK_SELECTION  1
#define configUSE_TICKLESS_IDLE                   0
#define configCPU_CLOCK_HZ                        (SystemCoreClock)
#define configTICK_RATE_HZ                        ((TickType_t)1000U)
#define configMAX_PRIORITIES                      6U
#define configMINIMAL_STACK_SIZE                  ((uint16_t)128U)
#define configMAX_TASK_NAME_LEN                   16U
#define configUSE_16_BIT_TICKS                    0
#define configIDLE_SHOULD_YIELD                   1
#define configUSE_TASK_NOTIFICATIONS              1
#define configTASK_NOTIFICATION_ARRAY_ENTRIES     1
#define configUSE_MUTEXES                         0
#define configUSE_RECURSIVE_MUTEXES               0
#define configUSE_COUNTING_SEMAPHORES             0
#define configQUEUE_REGISTRY_SIZE                 4U
#define configUSE_QUEUE_SETS                      0
#define configUSE_TIME_SLICING                    1
#define configUSE_NEWLIB_REENTRANT                0

#define configSUPPORT_STATIC_ALLOCATION           1
#define configSUPPORT_DYNAMIC_ALLOCATION          0
#define configTOTAL_HEAP_SIZE                     0U

#define configUSE_TIMERS                          0
#define configUSE_CO_ROUTINES                     0

#define configCHECK_FOR_STACK_OVERFLOW            2
#define configUSE_MALLOC_FAILED_HOOK              1
#define configUSE_IDLE_HOOK                       0
#define configUSE_TICK_HOOK                       0
#define configASSERT(x)                           if ((x) == 0) { taskDISABLE_INTERRUPTS(); for (;;) {} }

#ifdef __NVIC_PRIO_BITS
#define configPRIO_BITS                           __NVIC_PRIO_BITS
#else
#define configPRIO_BITS                           4U
#endif

#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY         15U
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY    5U
#define configKERNEL_INTERRUPT_PRIORITY                  (configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8U - configPRIO_BITS))
#define configMAX_SYSCALL_INTERRUPT_PRIORITY             (configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8U - configPRIO_BITS))

#define vPortSVCHandler                    SVC_Handler
#define xPortPendSVHandler                 PendSV_Handler
#define xPortSysTickHandler                SysTick_Handler

#define INCLUDE_vTaskDelay                 1
#define INCLUDE_vTaskDelayUntil            1
#define INCLUDE_xTaskGetSchedulerState     1
#define INCLUDE_xTaskGetCurrentTaskHandle  0
#define INCLUDE_uxTaskPriorityGet          0
#define INCLUDE_vTaskPrioritySet           0
#define INCLUDE_vTaskDelete                0
#define INCLUDE_vTaskSuspend               0

#endif
